# Question

You're given two dataframes: transactions and products.

The transactions dataframe contains transaction ids, product ids, and the total amount of each product sold.

The products dataframe contains product ids and prices.

Write a function to return a dataframe containing every transaction with a total value of over $100. Include the total value of the transaction as a new column in the dataframe.

## Solution 1

In [2]:
import pandas as pd

transactions = {"transaction_id" : [1, 2, 3, 4, 5], 
                "product_id" : [101, 102, 103, 104, 105], 
                "amount" : [3, 5, 8, 3, 2]}

products = {"product_id" : [101, 102, 103, 104, 105], 
            "price" : [20.00, 21.00, 15.00, 16.00, 52.00]}

df_transactions = pd.DataFrame(transactions)

df_products = pd.DataFrame(products)

In [7]:
df_transactions

   transaction_id  product_id  amount
0               1         101       3
1               2         102       5
2               3         103       8
3               4         104       3
4               5         105       2

In [8]:
df_products

   product_id  price
0         101   20.0
1         102   21.0
2         103   15.0
3         104   16.0
4         105   52.0

In [10]:
df1 = df_transactions
df2 = df_products

In [11]:
m_df = df1.merge(df2, left_on='product_id', right_on = 'product_id')
m_df

   transaction_id  product_id  amount  price
0               1         101       3   20.0
1               2         102       5   21.0
2               3         103       8   15.0
3               4         104       3   16.0
4               5         105       2   52.0

In [12]:
m_df['total_value'] = m_df['amount']* m_df['price']
m_df

   transaction_id  product_id  amount  price  total_value
0               1         101       3   20.0         60.0
1               2         102       5   21.0        105.0
2               3         103       8   15.0        120.0
3               4         104       3   16.0         48.0
4               5         105       2   52.0        104.0

In [30]:
f_df = m_df[m_df['total_value'] >100]
f_df

   transaction_id  product_id  amount  price  total_value
1               2         102       5   21.0        105.0
2               3         103       8   15.0        120.0
4               5         105       2   52.0        104.0